import React from 'react'
import styled from 'styled-components'


function DealPage() {
  return (
    <Container>
      <Title>ПУБЛИЧНАЯ ОФЕРТА</Title>
      <Paragraph>
        Интернет-магазин «Фурнитурарф.com», расположенный на доменном имени
        https://xn--80apolcbleeej.com/ ИП Кудашкин Даниил Владимирович
        и юридическим адресом  Ул 2-я нововатутинская д3.кв 40,
        в лице   руководителя, Кудашкина Даниила Владимировича,  действующего (- ей) на основании 	выписки из Единого государственного реестра индивидуальных предпринимателей ,  ОГРНИП 323774600696270 ИНН 775104710110,
        именуемое в дальнейшем «Продавец», публикует Публичную оферту о продаже Товара дистанционным способом.
      </Paragraph>

      <Title>1.	ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</Title>

      <Paragraph>
        <Subtitle>1.1.	</Subtitle>Публичная оферта (далее – «Оферта») - публичное предложение Продавца, адресованное неопределенному кругу лиц, заключить с Продавцом договор купли-продажи товара дистанционным способом (далее - «Договор») на условиях, содержащихся в настоящей Оферте, включая все Приложения.<br />
        <Subtitle>1.2.	</Subtitle>Заказ Товара на сайте Интернет-магазина – позиции указанные Покупателем из ассортимента Товара, предложенного к продаже, при оформлении заявки на приобретение Товара на сайте Интернет-магазина или через Оператора.<br />
      </Paragraph>
      <Title>2.	ОБЩИЕ ПОЛОЖЕНИЯ</Title>
      <Paragraph>
        <Subtitle>2.1. </Subtitle>Заказ Покупателем Товара, размещенного на сайте Интернет-магазина означает, что Покупатель согласен со всеми условиями настоящей Оферты.<br />
        <Subtitle>2.2. </Subtitle>Администрация сайта Интернет-магазина имеет право вносить изменения в Оферту без уведомления Покупателя.<br />
        <Subtitle>2.3. </Subtitle>Срок действия Оферты не ограничен, если иное не указано на сайте Интернет-магазина.<br />
        <Subtitle>2.4.</Subtitle> Продавец предоставляет Покупателю полную и достоверную информацию о Товаре, включая информацию об основных потребительских свойствах Товара, месте изготовления, а также информацию о гарантийном сроке и сроке годности Товара на сайте Интернет магазина, в разделе  возврат товара.<br />
      </Paragraph>
      <Title>3.	ЦЕНА ТОВАРА</Title>
      <Paragraph>
        <Subtitle>3.1.</Subtitle> Цена на каждую позицию Товара указана на сайте Интернет-магазина.<br />
        <Subtitle>3.2.</Subtitle> Продавец имеет право в одностороннем порядке изменить цену на любую позицию Товара.<br />
        <Subtitle>3.3.</Subtitle> В случае изменения цены на заказанный Товар Продавец обязуется в течение 3 дней проинформировать Покупателя об изменении цены Товара.<br />
        <Subtitle>3.4.</Subtitle> Покупатель вправе подтвердить либо аннулировать Заказ на приобретение Товара, если цена изменена Продавцом после оформления Заказа.<br />
        <Subtitle>3.5.</Subtitle> Изменение Продавцом цены на оплаченный Покупателем Товар не допускается.<br />
        <Subtitle>3.6.</Subtitle> Продавец указывает стоимость доставки Товара на сайте Интернет-магазина либо сообщает Покупателю при оформлении заказа Оператором.<br />
        <Subtitle>3.7.</Subtitle> Обязательства Покупателя по оплате Товара считаются исполненными с момента поступления Продавцом денежных средств.<br />
        <Subtitle>3.8.</Subtitle> Расчеты между Продавцом и Покупателем за Товар производятся способами, указанными на сайте Интернет-магазина в разделе  Оплата.
      </Paragraph>
      <Title>4. ОФОРМЛЕНИЕ ЗАКАЗА</Title>
      <Paragraph>
        <Subtitle>4.1.</Subtitle> Заказ Товара осуществляется Покупателем через Оператора по телефону   +7-977-454-67-77 или через сервис сайта Интернет-магазина  https://xn--80apolcbleeej.com/cart<br />
        <Subtitle>4.2.</Subtitle> При регистрации на сайте Интернет-магазина Покупатель обязуется предоставить следующую регистрационную информацию:<br />
        <Subtitle>4.2.1.</Subtitle> фамилия, имя, отчество Покупателя или указанного им лица (получателя);<br />
        <Subtitle>4.2.2.</Subtitle>  адрес, по которому следует доставить Товар (если доставка до адреса Покупателя);<br />
        <Subtitle>4.2.3.</Subtitle> адрес электронной почты;<br />
        <Subtitle>4.2.4.</Subtitle> контактный телефон.<br />
        <Subtitle>4.3.</Subtitle> Наименование, количество, ассортимент, артикул, цена выбранного Покупателем Товара указываются в корзине Покупателя на сайте Интернет-магазина.<br />
        <Subtitle>4.4.</Subtitle> Если Продавцу необходима дополнительная информация, он вправе запросить ее у Покупателя. В случае не предоставления необходимой информации Покупателем, Продавец не несет ответственности за выбранный Покупателем Товар.<br />
        <Subtitle>4.5.</Subtitle> При оформлении Заказа через Оператора (п. 4.1. настоящей Оферты) Покупатель обязуется предоставить информацию, указанную в п. 4.2. настоящей Оферты.<br />
        <Subtitle>4.6.</Subtitle> Принятие Покупателем условий настоящей Оферты осуществляется посредством внесения Покупателем соответствующих данных в регистрационную форму на сайте Интернет-магазина или при оформлении Заказа через Оператора. После оформления Заказа через Оператора данные о Покупателе регистрируются в базе данных Продавца. Утвердив Заказ выбранного Товара, Покупатель предоставляет Оператору необходимую информацию в соответствии с порядком, указанном в п. 4.2. настоящей Оферты.<br />
        <Subtitle>4.7.</Subtitle> Продавец не несет ответственности за содержание и достоверность информации, предоставленной Покупателем при оформлении Заказа.<br />
        <Subtitle>4.8.</Subtitle> Покупатель несет ответственность за достоверность предоставленной информации при оформлении Заказа.<br />
        <Subtitle>4.9.</Subtitle> Договор купли-продажи дистанционным способом между Продавцом и Покупателем считается заключенным с момента выдачи Продавцом Покупателю кассового или товарного чека либо иного документа, подтверждающего оплату Товара.<br />
      </Paragraph>
      <Title>5.	ДОСТАВКА И ПЕРЕДАЧА ТОВАРА ПОКУПАТЕЛЮ</Title>
      <Paragraph>
        <Subtitle>5.1.</Subtitle> Продавец оказывает Покупателю услуги по доставке Товара одним из способов указанных на сайте Интернет-магазина.<br />
        <Subtitle>5.2.</Subtitle> Если Договор купли-продажи товара дистанционным способом (далее – Договор) заключен с условием о доставке Товара Покупателю, Продавец обязан в установленный Договором срок доставить Товар в место, указанное Покупателем, а если место доставки Товара Покупателем не указано, то по месту его жительства или регистрации.<br />
        <Subtitle>5.3. </Subtitle>Место доставки Товара Покупатель указывает при оформлении Заказа на приобретение Товара.<br />
        <Subtitle>5.4.</Subtitle> Срок доставки Товара Покупателю состоит из срока обработки заказа и срока доставки.<br />
        <Subtitle>5.5.</Subtitle> Доставленный Товар передается Покупателю, а при отсутствии Покупателя - любому лицу, предъявившему квитанцию или иной документ, подтверждающий заключение Договора или оформление доставки Товара.<br />
        <Subtitle>5.6.</Subtitle> В момент передачи Товара в обязательном порядке в письменной форме Покупателю сообщаются сведения, предусмотренные в Приложении №  7 к Договору.<br />
        <Subtitle>5.7.</Subtitle> Информация о Товаре доводится до сведения Покупателя в технической документации, прилагаемой к Товару, на этикетках, путем нанесения маркировки или иным способом, принятым для отдельных видов товаров.<br />
        <Subtitle>5.8.</Subtitle> Сведения об обязательном подтверждении соответствия Товара представляются в порядке и способами, которые установлены законодательством Российской Федерации о техническом регулировании, и включают в себя сведения о номере документа, подтверждающего такое соответствие, о сроке его действия и об организации, его выдавшей.<br />
      </Paragraph>
      <Title>6. РЕКВИЗИТЫ ПРОДАВЦА</Title>
      <Paragraph>
        <Subtitle>Продавец: </Subtitle><br />
        <Subtitle>ИП Кудашкин Даниил Владимирович </Subtitle><br />
        <Subtitle>+7-977-454-67-77 </Subtitle><br />
        <Subtitle>Адрес: </Subtitle><br />
        <Subtitle>Ул 2-я нововатутинская дом 3 кв 40 </Subtitle><br />
        <Subtitle>Банковские реквизиты </Subtitle><br />
        <Subtitle>К/с </Subtitle><br />
        <Subtitle>30101810745374525104 </Subtitle><br />
        <Subtitle>Бик: 044525104 </Subtitle><br />
        <Subtitle>Р/с 4080 2810 0200 0014 0182 </Subtitle><br />
      </Paragraph>
      <Paragraph>
        Внимательно ознакомьтесь с текстом публичной оферты, и если Вы не согласны с каким-либо пунктом оферты, Вы вправе отказаться от покупки Товаров, предоставляемых Продавцом, и не совершать действий, указанный в п. 2.1. настоящей Оферты.
      </Paragraph>
      <Paragraph>
        Согласен с договором
      </Paragraph>
    </Container>
  )
}

export default DealPage

const Container = styled.div`
  width: 100%;
  max-width: 1280px;
  padding: 10px;
  display: flex;
  flex-direction: column;
  margin: 0 auto;
  font-weight: 500;
  font-size: 20px;

  /* height: 100%; */
  /* @media (max-width: 991px) {
        height: auto;
    } */
`

const Title = styled.h1`
  text-align: center;
  font-size: 26px;
  font-weight: 700;
  margin-top: 10px;
`

const Paragraph = styled.p`
  text-align: left;
  line-height: 25px;
  margin-top: 10px;
`

const Subtitle = styled.span`
  margin-top: 15px;
  font-size: 20px;
  font-weight: 600;
`