import React from 'react'
import styled from 'styled-components'


function PolicyPage() {
  return (
    <Container>
      <Title>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</Title>
      <Date>г. Москва, «17» ноября 2023 г.</Date>
      <Paragraph>
        Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую Интернет-магазин «Фурнитурарф.com», расположенный на доменном имени https://xn--80apolcbleeej.com/, может получить о Пользователе во время использования сайта Интернет-магазина, программ и продуктов Интернет-магазина.
      </Paragraph>

      <Title>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</Title>
      <Paragraph>
        <Subtitle>1.1.</Subtitle> В настоящей Политике конфиденциальности используются следующие термины: <br />
        <Subtitle>1.1.1.</Subtitle> «Администрация сайта Интернет-магазина (далее – Администрация сайта) » – уполномоченные сотрудники на управления сайтом, действующие от имени ИП Кудашкин Даниил Владимирович, которые организуют и (или) осуществляют обработку персональных данных, а также определяют цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными. <br />
        <Subtitle>1.1.2.</Subtitle> «Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).<br />
        <Subtitle>1.1.3.</Subtitle> «Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.<br />
        <Subtitle>1.1.4.</Subtitle> «Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.<br />
        <Subtitle>1.1.5.</Subtitle> «Пользователь сайта Интернет-магазина (далее Пользователь)» – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт интернет-магазина.<br />
        <Subtitle>1.1.6.</Subtitle> «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.<br />
        <Subtitle>1.1.7.</Subtitle> «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.<br />
      </Paragraph>

      <Title>2. ОБЩИЕ ПОЛОЖЕНИЯ</Title>
      <Paragraph>
        <Subtitle>2.1.</Subtitle> Использование Пользователем сайта Интернет-магазина означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.<br />
        <Subtitle>2.2.</Subtitle> В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта Интернет-магазина.<br />
        <Subtitle>2.3.</Subtitle> Настоящая Политика конфиденциальности применяется только к сайту Интернет-магазина «Фурнитурарф.com». Интернет-магазин не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте Интернет-магазина.<br />
        <Subtitle>2.4.</Subtitle> Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем сайта Интернет-магазина.<br />
      </Paragraph>

      <Title>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</Title>
      <Paragraph>
        <Subtitle>3.1.</Subtitle> Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта интернет-магазина по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации сайта при регистрации на сайте интернет-магазина или при оформлении заказа для приобретения Товара.<br />
        <Subtitle>3.2.</Subtitle> Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы на Сайте интернет-магазина  Фурнитурарф.com в разделе  корзина и включают в себя следующую информацию:<br />
        <Subtitle>3.2.1.</Subtitle> фамилию, имя, отчество Пользователя;<br />
        <Subtitle>3.2.2.</Subtitle> контактный телефон Пользователя;<br />
        <Subtitle>3.2.3.</Subtitle> адрес электронной почты (e-mail);<br />
        <Subtitle>3.2.4.</Subtitle> адрес доставки Товара;<br />
        <Subtitle>3.2.5.</Subtitle> место жительство Пользователя.<br />
        <Subtitle>3.3.</Subtitle> Интернет-магазин защищает Данные, которые автоматически передаются в процессе просмотра рекламных блоков и при посещении страниц, на которых установлен статистический скрипт системы ("пиксель"):<br />
        <Subtitle>3.3.1.</Subtitle> Отключение cookies может повлечь невозможность доступа к частям сайта Интернет-магазина, требующим авторизации.<br />
        <Subtitle>3.3.2.</Subtitle> Интернет-магазин осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля законности проводимых финансовых платежей.<br />
        <Subtitle>3.4.</Subtitle> Любая иная персональная информация неоговоренная выше (история покупок, используемые браузеры и операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.<br />
      </Paragraph>
      <Title>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</Title>
      <Paragraph>
        <Subtitle>4.1.</Subtitle> Персональные данные Пользователя Администрация сайта интернет-магазина может использовать в целях:<br />
        <Subtitle>4.1.1.</Subtitle> Идентификации Пользователя, зарегистрированного на сайте Интернет-магазина, для оформления заказа и (или) заключения Договора купли-продажи товара дистанционным способом с  Фурнитурарф.com.<br />
        <Subtitle>4.1.2.</Subtitle> Предоставления Пользователю доступа к персонализированным ресурсам Сайта интернет-магазина.<br />
        <Subtitle>4.1.3.</Subtitle> Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта интернет-магазина, оказания услуг, обработка запросов и заявок от Пользователя.<br />
        <Subtitle>4.1.4.</Subtitle> Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.<br />
        <Subtitle>4.1.5.</Subtitle> Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.<br />
        <Subtitle>4.1.6.</Subtitle> Создания учетной записи для совершения покупок, если Пользователь дал согласие на создание учетной записи.<br />
        <Subtitle>4.1.7.</Subtitle> Уведомления Пользователя Сайта интернет-магазина о состоянии Заказа.<br />
        <Subtitle>4.1.8.</Subtitle> Обработки и получения платежей, подтверждения налога или налоговых льгот, оспаривания платежа, определения права на получение кредитной линии Пользователем.<br />
        <Subtitle>4.1.9.</Subtitle> Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем связанных с использованием Сайта интернет-магазина.<br />
        <Subtitle>4.1.10.</Subtitle> Предоставления Пользователю с его согласия, обновлений продукции, специальных предложений, информации о ценах, новостной рассылки и иных сведений от имени Интернет-магазина или от имени партнеров Интернет-магазина.<br />
        <Subtitle>4.1.11.</Subtitle> Осуществления рекламной деятельности с согласия Пользователя.<br />
        <Subtitle>4.1.12.</Subtitle> Предоставления доступа Пользователю на сайты или сервисы партнеров Интернет-магазина с целью получения продуктов, обновлений и услуг.<br />
      </Paragraph>

      <Title>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</Title>
      <Paragraph>
        <Subtitle>5.1.</Subtitle> Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.<br />
        <Subtitle>5.2.</Subtitle> Пользователь соглашается с тем, что Администрация сайта вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, исключительно в целях выполнения заказа Пользователя, оформленного на Сайте интернет-магазина «Фурнитурарф.com», включая доставку Товара.<br />
        <Subtitle>5.3.</Subtitle> Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.<br />
        <Subtitle>5.4.</Subtitle> При утрате или разглашении персональных данных Администрация сайта информирует Пользователя об утрате или разглашении персональных данных.<br />
        <Subtitle>5.5.</Subtitle> Администрация сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.<br />
        <Subtitle>5.6.</Subtitle> Администрация сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.<br />
      </Paragraph>

      <Title>6. ОБЯЗАТЕЛЬСТВА СТОРОН</Title>
      <Paragraph>
        <Subtitle>6.1.</Subtitle> Пользователь обязан:<br />
        <Subtitle>6.1.1.</Subtitle> Предоставить информацию о персональных данных, необходимую для пользования Сайтом интернет-магазина.<br />
        <Subtitle>6.1.2.</Subtitle> Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.<br />
        <Subtitle>6.2.</Subtitle> Администрация сайта обязана:<br />
        <Subtitle>6.2.1.</Subtitle> Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.<br />
        <Subtitle>6.2.2.</Subtitle> Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики Конфиденциальности.<br />
        <Subtitle>6.2.3.</Subtitle> Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.<br />
        <Subtitle>6.2.4.</Subtitle> Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.<br />
      </Paragraph>
      <Title>7. ОТВЕТСТВЕННОСТЬ СТОРОН</Title>
      <Paragraph>
        <Subtitle>7.1.</Subtitle> Администрация сайта, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.<br />
        <Subtitle>7.2.</Subtitle> В случае утраты или разглашения Конфиденциальной информации Администрация сайта не несёт ответственности, если данная конфиденциальная информация:<br />
        <Subtitle>7.2.1.</Subtitle> Стала публичным достоянием до её утраты или разглашения.<br />
        <Subtitle>7.2.2.</Subtitle> Была получена от третьей стороны до момента её получения Администрацией сайта.<br />
        <Subtitle>7.2.3.</Subtitle> Была разглашена с согласия Пользователя.<br />
      </Paragraph>

      <Title>8. РАЗРЕШЕНИЕ СПОРОВ</Title>
      <Paragraph>
        <Subtitle>8.1.</Subtitle> До обращения в суд с иском по спорам, возникающим из отношений между Пользователем сайта Интернет-магазина и Администрацией сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).<br />
        <Subtitle>8.2.</Subtitle> Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.<br />
        <Subtitle>8.3.</Subtitle> При не достижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Российской Федерации.<br />
        <Subtitle>8.4.</Subtitle> К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией сайта применяется действующее законодательство Российской Федерации.<br />
      </Paragraph>

      <Title>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</Title>
      <Paragraph>
        <Subtitle>9.1.</Subtitle> Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.<br />
        <Subtitle>9.2.</Subtitle> Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте интернет-магазина, если иное не предусмотрено новой редакцией Политики конфиденциальности.<br />
        <Subtitle>9.3.</Subtitle> Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать в профиль.<br />
        <Subtitle>9.4.</Subtitle> Действующая Политика конфиденциальности размещена на странице по адресу <a href="https://xn--80apolcbleeej.com/">https://xn--80apolcbleeej.com/</a> адрес магазина.<br />
      </Paragraph>

      <Date>Обновлено «17» ноября 2023 г.</Date>
    </Container>
  )
}

export default PolicyPage

const Container = styled.div`
  width: 100%;
  max-width: 1280px;
  padding: 10px;
  display: flex;
  flex-direction: column;
  margin: 0 auto;
  font-weight: 500;
  font-size: 20px;
`;

const Title = styled.h1`
  text-align: center;
  font-size: 26px;
  font-weight: 700;
  margin-top: 10px;
`;

const Date = styled.p`
  text-align: right;
  margin-top: 10px;
  font-style: italic;
`;

const Paragraph = styled.p`
  text-align: left;
  line-height: 25px;
  margin-top: 10px;
`;

const Subtitle = styled.span`
  margin-top: 15px;
  font-size: 20px;
  font-weight: 600;
`;